Revit 2024 API
Transform1D.GetInverse Method
 Gets the inverse transformation of this transformation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public Transform1D GetInverse()
Visual Basic
Public Function GetInverse As Transform1D
Visual C++
public:
Transform1D^ GetInverse()
Remarks
 The transformation matrix A is invertible if there exists a transformation matrix B such that A*B = B*A = I (identity).
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  This transformation is singular.
See Also
Transform1D Class
Autodesk.Revit.DB Namespace